docs/posts/2015-01-13-christ-the-king-sunday.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Christ the King Sunday</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Christ the King Sunday</h1>
<p class="subtitle" role="doc-subtitle">Jan 13, 2015</p>
</header><p>
Mitch opened his sermon at NorthHaven on Christ the King Sunday recounting the scene at the end of The Return of the King in which Aragorn, the newly crowned king, bows down to the hobbits. That brought to mind their first meeting in The Fellowship of the Ring where Frodo is trying to decide if Aragorn should be trusted:
</p>

<blockquote>
<p>
At last Frodo spoke with hesitation. &ldquo;I believed that you were a friend before the letter came,&rdquo; he said, &ldquo;or at least I wished to. You have frightened me several times tonight, but never in the way the servants of the Enemy would, or so I imagine. I think one of his spies would - well, seem fairer and feel fouler, if you understand.&rdquo;
</p>
</blockquote>

<p>
What does a king look like?
</p>

<p>
Is he haughty,<br>
unapproachable,<br>
controlling,<br>
and cold?
</p>

<p>
Regal and magnificent,<br>
to be respected and admired,<br>
but only from afar?
</p>

<p>
Majestic and powerful,<br>
a conquering hero<br>
who rides into the city<br>
astride a warhorse?
</p>

<p>
Surely the king<br>
would not appear<br>
as the son of<br>
a poor family,<br>
a laborer with<br>
calloused hands?
</p>

<p>
Homeless,<br>
who owns nothing,<br>
and rides into the city<br>
on a shabby, borrowed donkey?
</p>

<p>
One who suffered injustice,<br>
and was executed by<br>
the forces of the state?
</p>

<p>
Father,
</p>

<p>
Teach me to<br>
embrace the King<br>
as he is,<br>
and not the King<br>
as I want him to be.
</p>

<p>
<i>Amen</i>
</p>


<div class="tagline" id="org31d036c">
<p>
Tagged: <a href="../tags/prayer.html">Prayer</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
